#+TITLE: 
#+SETUPFILE: /home/moamen/new-git/dot-files/emacs/orgmode-export-themes/readtheorg_theme/theme-readtheorg-local.setup

** basics
   #+BEGIN_SRC emacs-lisp
     (load-theme 'jetbrains-darcula 1)
     (custom-set-faces
      '(default ((t (:height 98 :width normal :foundry "unknown" :family "Fira Code"))))
      '(region ((t ( :background "#44000D" :weight bold))))
      '(cursor ((t (:background "#C6DE41" :foreground "black"))))
      '(hl-line  ((t (  :background "#1D1D00"))))
      ;;'(line-number  ((t ( :inherit default :background "#3c3836" :foreground "#C6DE41"))))
      ;;'(line-number-current-line ((t (   :inherit default :background "#1D1D00" :foreground "#C6DE41" :inverse-video t))))
      ;;'(org-checkbox ((t (  :foreground "#fe8019" :weight extra-bold))))
      '(org-hide ((t (   :foreground "#282828"))))
      ;;'(org-level-1  ((t (:foreground "#fb4934" :weight extra-bold :height 1.4))))
      '(org-level-1  ((t (:weight extra-bold :height 1.4))))
      ;;'(org-level-2  ((t (:foreground "#b8bb26" :weight extra-bold :height 1.2))))
      '(org-level-2  ((t (:weight extra-bold :height 1.2))))
      ;;'(org-level-3  ((t (:foreground "#fabd2f" :weight bold))))
      ;;'(org-level-4  ((t (:foreground "#d3869b"))))
      ;;'(org-level-5  ((t (:foreground "#83a598"))))
      ;;'(org-tag ((t (:foreground "#7CBD1E" :weight bold))))
      '(doom-modeline-bar ((t (:inherit highlight :background "black")))))

     ;; ;; no need to start the server on startup 
     ;; ;;(server-start)
     ;; Let's get a backtrace when errors are
     (setq debug-on-error t)
     ;; Display byte-compiler warnings on error
     (setq byte-compile-debug t)


     ;;The default is to wait 1 second, which I find a bit long
     (setq echo-keystrokes 0.1)

     ;; Stop polluting the directory with auto-saved files and backup
     (setq auto-save-default nil)
     (setq make-backup-files nil)
     (setq auto-save-list-file-prefix nil)
     ;; diable lockfiles
     (setq create-lockfiles nil)

     ;; ???
     (setq kill-whole-line t)
     (setq kill-read-only-ok t)
     (setq require-final-newline t)

     ;; Scrolling done right
     (setq scroll-step 1 scroll-conservatively 10000)

     ;; Always use "y" for "yes"
     (fset 'yes-or-no-p 'y-or-n-p)
     (setq fill-column 72)
     (setq max-lisp-eval-depth 10000)




     (ido-mode 1)                           ;; better autocomplation
     (blink-cursor-mode 0)                  ;; disable binking cursor
     (show-paren-mode 1)                    ;; show matching parens or failure to match
     (global-auto-revert-mode 1)            ;; reload files that chage on disk
     (column-number-mode 1)                 ;; show column numbers in mode line
     (global-hl-line-mode 1)                ;; change the color of the line the cursor is on
     (setq visible-bell nil)                  ;; disable sounds
     (setq-default truncate-lines t)         ;; default to NOT wrapping long lines in display
     (tool-bar-mode 0)                       ;; hide the tool bar
     (menu-bar-mode 0)                       ;; hide the "File Edit..." menu
     (scroll-bar-mode 1)                    ;; hide the scroll bars

     (setq inhibit-startup-screen t)         ;; don't show the "splash" screen


     ;; line numbers
     (global-display-line-numbers-mode t)
     ;;(setq display-line-numbers-type 'relative)

     ;; Default Frame
     (add-to-list 'initial-frame-alist '(fullscreen . maximized))
     ;; (setq initial-frame-alist
     ;; 	'((left-margin-width . 10)
     ;; 	  (menu-bar-lines . 0)
     ;; 	  (tool-bar-lines . 0)
     ;; 	  (horizontal-scroll-bars . nil)
     ;; 	  (vertical-scroll-bars . nil)))

     ;; Don't display initial messages
     (setq initial-scratch-message "
	  ██╗  ██╗███████╗██╗     ██╗      ██████╗     ███╗   ███╗ ██████╗  █████╗ ███╗   ███╗███████╗███╗   ██╗
	  ██║  ██║██╔════╝██║     ██║     ██╔═══██╗    ████╗ ████║██╔═══██╗██╔══██╗████╗ ████║██╔════╝████╗  ██║
	  ███████║█████╗  ██║     ██║     ██║   ██║    ██╔████╔██║██║   ██║███████║██╔████╔██║█████╗  ██╔██╗ ██║
	  ██╔══██║██╔══╝  ██║     ██║     ██║   ██║    ██║╚██╔╝██║██║   ██║██╔══██║██║╚██╔╝██║██╔══╝  ██║╚██╗██║
	  ██║  ██║███████╗███████╗███████╗╚██████╔╝    ██║ ╚═╝ ██║╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗██║ ╚████║
	  ╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝ ╚═════╝     ╚═╝     ╚═╝ ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝╚═╝  ╚═══╝")
     (setq initial-major-mode 'org-mode)
     (setq inhibit-startup-screen t)
     (setq inhibit-startup-echo-area-message "Hi Moamen :)")
     (setq use-dialog-box nil)
     (setq default-frame-alist initial-frame-alist)
     (setq line-move-visual nil)
     (setq tab-bar-show nil)

     ;; change the selection color 
     ;;(set-face-attribute 'region nil :background "#44000D" :weight 'bold)



     (set-fontset-font "fontset-default" nil 
		       (font-spec :size 28 :name "Cascadia Code PL"))

     ;; Setting English Font
     (set-face-attribute
      'default nil
      :stipple nil
      :height 130
      :width 'normal
      :inverse-video nil
      :box nil
      :strike-through nil
      :overline nil
      :underline nil
      :slant 'normal
      :weight 'normal
      :foundry "outline"
      :family "DejaVu Sans Mono for Powerline")
     ;; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
     (setq utf-translate-cjk-mode nil)

     (set-language-environment 'utf-8)
     (setq locale-coding-system 'utf-8)

     ;; set the default encoding system
     (prefer-coding-system 'utf-8)
     (setq default-file-name-coding-system 'utf-8)
     (set-default-coding-systems 'utf-8)
     (set-terminal-coding-system 'utf-8)
     (set-keyboard-coding-system 'utf-8)
     ;; backwards compatibility as default-buffer-file-coding-system
     ;; is deprecated in 23.2.
     (if (boundp buffer-file-coding-system)
	 (setq buffer-file-coding-system 'utf-8)
       (setq default-buffer-file-coding-system 'utf-8))

     ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
     (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
   #+END_SRC
   
   #+RESULTS:
   | UTF8_STRING | COMPOUND_TEXT | TEXT | STRING |

*** basic configuration and packages setup
   #+begin_src emacs-lisp
     ;; enable spell checking in latex mode 
     (add-hook 'LaTeX-mode-hook 'flyspell-mode)
     ;;(add-hook 'prog-mode-hook 'flyspell-prog-mode)

     (use-package pdf-tools
       :ensure t
       :config
       (pdf-tools-install)
       (setq-default pdf-view-display-size 'fit-page)
       (setq pdf-annot-activate-created-annotations t)
       (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
       (define-key pdf-view-mode-map (kbd "C-r") 'isearch-backward)
       (add-hook 'pdf-view-mode-hook (lambda () (bms/pdf-midnite-amber))))

     (use-package tex
       :ensure auctex
       :mode ("\\.tex\\'" . latex-mode)
       :config
       (setq TeX-source-correlate-mode t)
       (setq TeX-source-correlate-method 'synctex)
       (setq TeX-auto-save t)
       (setq TeX-parse-self t)
       (setq reftex-plug-into-AUCTeX t)
       (setq-default TeX-master "main.tex")
       (pdf-tools-install)
       (setq TeX-view-program-selection '((output-pdf "PDF Tools") TeX-source-correlate-start-server t))
       ;; Update PDF buffers after successful LaTeX runs
       (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))


     (use-package latex-extra
       :ensure t
       :hook (LaTeX-mode . latex-extra-mode)
       :bind (:map latex-extra-mode-map ("C-c C-f" . nil)))


     ;; (use-package auctex-latexmk
     ;;   :ensure t
     ;;   :config
     ;;   (auctex-latexmk-setup)
     ;;   (setq auctex-latexmk-inherit-TeX-PDF-mode t))


     (use-package company-auctex
       :ensure t
       :init (company-auctex-init))


     (use-package company-math
       :ensure t)



     (use-package reftex
       :ensure t
       :hook (LaTeX-mode . turn-on-reftex)
       :config
       (setq reftex-cite-prompt-optional-args t)) ;; Prompt for empty optional arguments in cite

     (use-package company-reftex 
       :ensure t
       )

     ;; local configuration for TeX modes
     (defun my-latex-mode-setup ()
       (setq-local company-backends
		   (append '((company-math-symbols-latex company-math-symbols-unicode company-latex-commands company-auctex company-reftex))
			   company-backends)))

     (add-hook 'LaTeX-mode-hook 'my-latex-mode-setup)


     ;;(add-hook 'LaTeX-mode-hook #'lsp)
     ;;(setq lsp-latex-texlab-executable "/home/moamen/.cargo/bin/texlab")

   #+end_src

  #+RESULTS:
  | preview-mode-setup | lsp | my-latex-mode-setup | turn-on-reftex | latex-extra-mode | flyspell-mode |
